ChenYu147/LockInLife/nRF51_SDK_9.0.0_锁生活_7-10/components/libraries/Wechat/services/products/mpbledemo2.c
/*
*	WeChat mpbledemo2 
*
*	author by anqiren  2014/12/02  V1.0bat
*
**/
#include <string.h>
#include <stdlib.h>
#include <stdint.h>
#include <stdio.h>


#include "nrf_gpio.h"
#include "epb_MmBp.h"
#include "ble_wechat_util.h"
#include "ble_wechat_service.h"
#include "app_error.h"
#include "md5.h"
#include "crc32.h"
#include "AES.h"
#include "mpbledemo2.h"
#include "comsource.h"
#include "LED.h"
#include "communication.h"

mpbledemo2_info m_info = {CMD_NULL, {NULL, 0}};

#if defined EAM_md5AndNoEnrypt || EAM_md5AndAesEnrypt
	uint8_t md5_type_and_id[16];
#endif

uint8_t challeange[CHALLENAGE_LENGTH] = {0x11,0x22,0x33,0x44}; //为了方便这里填了一组确定的数组，使用过程中请自行生成随机数

mpbledemo2_state mpbledemo2Sta = {false, false, false, false, false, false,0,0,0};
const uint8_t key[16] = DEVICE_KEY
uint8_t session_key[16] = {0};
data_handler *m_mpbledemo2_handler = NULL;


/**@brief   Function for the light initialization.
 *
 * @details Initializes all lights used by this application.
 */

int32_t mpbledemo2_get_md5(void)
{
	int32_t error_code = 0;
	#if defined EAM_md5AndNoEnrypt || EAM_md5AndAesEnrypt
	char device_type[] = DEVICE_TYPE;
	char device_id[] = DEVICE_ID;
	char argv[sizeof(DEVICE_TYPE) + sizeof(DEVICE_ID) - 1];
	memcpy(argv,device_type,sizeof(DEVICE_TYPE));
/*when add the DEVICE_ID to DEVICE_TYPE, the offset shuld -1 to overwrite '\0'  at the end of DEVICE_TYPE */
	memcpy(argv + sizeof(DEVICE_TYPE)-1,device_id,sizeof(DEVICE_ID));
#ifdef CATCH_LOG	
	printf ( "\r\nDEVICE_TYPE and DEVICE_ID:%s\r\n",argv);
#endif
	error_code = md5(argv, md5_type_and_id);
#ifdef CATCH_LOG
	printf ( "\r\nMD5:");
	for ( uint8_t i = 0; i < 16; i++ )
	printf ( " %02x", md5_type_and_id[i] );
	putchar ( '\n' );
#endif
#endif
	return error_code;
}

void mpbledemo2_reset()
{
	mpbledemo2Sta.auth_send = false;
	mpbledemo2Sta.auth_state = false;
	mpbledemo2Sta.indication_state = false;
	mpbledemo2Sta.init_send = false;
	mpbledemo2Sta.init_state = false;
	mpbledemo2Sta.send_data_seq = 0;
	mpbledemo2Sta.push_data_seq = 0;
	mpbledemo2Sta.seq = 0;
}
int32_t mpbledemo2_init(void)
{
	mpbledemo2_reset();
	return (mpbledemo2_get_md5());
}

/**@brief Function for handling button pull events.
 *
 * @param[in]   pin_no   The pin number of the button pressed.
 */
int32_t mpbledemo2_button_handler(void *p_wcs, uint8_t pin_no)
{
	ble_wechat_t *p_wcs_t = (ble_wechat_t*)p_wcs;
		if (m_mpbledemo2_handler == NULL) {
			m_mpbledemo2_handler = get_handler_by_type(PRODUCT_TYPE_MPBLEDEMO2);
		}
		uint8_t *data = NULL;
		uint32_t len = 0;
		switch (pin_no)
    {
        case MPBLEDEMO2_BUTTON_1:
				{
				#ifdef CATCH_LOG
					printf("\r\n button 1");
				#endif
					ARGS_ITEM_SET(mpbledemo2_info, m_mpbledemo2_handler->m_data_produce_args, cmd, CMD_SENDDAT);
					//填指令，这里是发送数据就填 CMD_SENDDAT
					ARGS_ITEM_SET(mpbledemo2_info, m_mpbledemo2_handler->m_data_produce_args, send_msg.len, sizeof(SEND_HELLO_WECHAT));
					//填发送数据长度，这里是发送数据就填 sizeof(SEND_HELLO_WECHAT)
					ARGS_ITEM_SET(mpbledemo2_info, m_mpbledemo2_handler->m_data_produce_args, send_msg.str, SEND_HELLO_WECHAT);
					//填发送的数据，这里是发送数据就填 SEND_HELLO_WECHAT
				}
            break;
        default:
            break;
    }
		m_mpbledemo2_handler->m_data_produce_func(m_mpbledemo2_handler->m_data_produce_args, &data, &len);
		//这里回调数据生产函数，来产生数据
		if(data == NULL)
		{
			return errorCodeProduce;
		}
		ble_wechat_indicate_data(p_wcs_t,m_mpbledemo2_handler, data, len);
		//发送数据
		m_mpbledemo2_handler->m_data_free_func(data,len);
		//发送数据之后回调相应的 free 函数，避免内存泄漏。 
		return 0;
}

int32_t device_auth(ble_wechat_t *p_wcs)
{	
	if (m_mpbledemo2_handler == NULL) {
			m_mpbledemo2_handler = get_handler_by_type(PRODUCT_TYPE_MPBLEDEMO2);
		}
		uint8_t *data = NULL;
		uint32_t len = 0;
		
		ARGS_ITEM_SET(mpbledemo2_info, m_mpbledemo2_handler->m_data_produce_args, cmd, CMD_AUTH);	
		m_mpbledemo2_handler->m_data_produce_func(m_mpbledemo2_handler->m_data_produce_args, &data, &len);
		if(data == NULL)
		{
			return errorCodeProduce;
		}
		//sent data
		
	#ifdef CATCH_LOG
		printf("\r\n auth send! ");
	#endif
		#ifdef CATCH_LOG
				printf("\r\n##send data: ");
				uint8_t *d = data;
				for(uint8_t i=0;i<len;++i){
				printf(" %x",d[i]);}
				BpFixHead *fix_head = (BpFixHead *)data;
				printf("\r\n CMDID: %d", ntohs(fix_head->nCmdId));
				printf("\r\n len: %d", ntohs(fix_head->nLength ));
				printf("\r\n Seq: %d", ntohs(fix_head->nSeq));
			#endif
				ble_wechat_indicate_data(p_wcs, m_mpbledemo2_handler, data, len);
				m_mpbledemo2_handler->m_data_free_func(data,len);
		return 0;
	}
	

int32_t	device_init(ble_wechat_t *p_wcs)
	{
		uint8_t *data = NULL;
		uint32_t len = 0;
		ARGS_ITEM_SET(mpbledemo2_info, m_mpbledemo2_handler->m_data_produce_args, cmd, CMD_INIT);
		m_mpbledemo2_handler->m_data_produce_func(m_mpbledemo2_handler->m_data_produce_args, &data, &len);
		if(data == NULL)
		{
			return errorCodeProduce;
		}
		//sent data
		
		ble_wechat_indicate_data(p_wcs, m_mpbledemo2_handler, data, len);
		m_mpbledemo2_handler->m_data_free_func(data,len);
	#ifdef CATCH_LOG
		printf("\r\n init send! ");
	#endif
		#ifdef CATCH_LOG
				printf("\r\n##send data: ");
				uint8_t *d = data;
				for(uint8_t i=0;i<len;++i){
				printf(" %x",d[i]);}
				BpFixHead *fix_head = (BpFixHead *)data;
				printf("\r\n CMDID: %d", ntohs(fix_head->nCmdId));
				printf("\r\n len: %d", ntohs(fix_head->nLength ));
				printf("\r\n Seq: %d", ntohs(fix_head->nSeq));
			#endif
		return 0;
}

/*设备处理 write 事件函数
		判断 indicate  是否被订阅，如果订阅了则设置状态位为 true，
		否则为 false。订阅成功之后才能发送数据。*/
static void mpbledemo2_on_write(ble_wechat_t *p_wcs, ble_evt_t * p_ble_evt)
{
	ble_gatts_evt_write_t * p_evt_write = &p_ble_evt->evt.gatts_evt.params.write;
	if (p_evt_write->handle == p_wcs->indicate_handles.cccd_handle&& p_evt_write->len == 2) 
		{
			if (ble_srv_is_indication_enabled(p_evt_write->data))
				{
					mpbledemo2Sta.indication_state = true;
				#ifdef CATCH_LOG
					printf("\r\n indication_enabled!");
				#endif
				} 
			else
				{
					mpbledemo2Sta.indication_state = false;
				}
		}
}

/* 设备连接断开时，复位设备，以便在重新连接是重新进行 auth 和 init 等相关操作。 */
static void mpbledemo2_on_disconnect(ble_wechat_t *p_wcs, ble_evt_t * p_ble_evt)
{
	mpbledemo2_reset();
}
void ble_mpbledemo2_on_ble_evt(void *p_wcs, void *p_ble_evt)
{
	ble_wechat_t *p_wcs_t = (ble_wechat_t*)p_wcs;
	ble_evt_t* p_ble_evt_t = (ble_evt_t*)p_ble_evt;
	switch (p_ble_evt_t->header.evt_id)
    {
			case BLE_GAP_EVT_CONNECTED:
			break;
      case BLE_GAP_EVT_DISCONNECTED:
				mpbledemo2_on_disconnect(p_wcs_t, p_ble_evt);
			break;
			case BLE_GATTS_EVT_WRITE:
				mpbledemo2_on_write(p_wcs_t, p_ble_evt);
			break;
			default:
				break;
    }
}

/*设备主流程函数 
		根据设备状态，判断是否进行 auth 或者 init 操作*/
void mpbledemo2_main_process(void *p_wcs)
{
	ble_wechat_t *p_wcs_t = (ble_wechat_t*)p_wcs;
	int error_code;
	//			indicate 订阅成功  					&& 				还未 auth 成功			&&		还未发送 auth 数据包		就进行 auth 操作。
	if((mpbledemo2Sta.indication_state) && (!mpbledemo2Sta.auth_state) && (!mpbledemo2Sta.auth_send) )
	{
		error_code = device_auth(p_wcs_t);
		APP_ERROR_CHECK(error_code);
		mpbledemo2Sta.auth_send = true;
	//auth 之后把 auth_send 状态设置为 true，以避免重复发 auth 包。		
	}
	//			auth 成功了						&&					还未 init 成功包		&&				还未发送 init 包				就进行 init 操作。
	if((mpbledemo2Sta.auth_state) && (!mpbledemo2Sta.init_state) && (!mpbledemo2Sta.init_send))
	{
		error_code = device_init(p_wcs_t);
		APP_ERROR_CHECK(error_code);
		mpbledemo2Sta.init_send = true;
		//init 之后把 init_send 状态设置为 true，以避免重复发 init 包。
	}
	return ;
}

