ChenYu147/LockInLife/nRF51_SDK_9.0.0_锁生活_7-10/components/libraries/Wechat/services/products/mpbledemo2.c
//设备释放内存函数
void mpbledemo2_data_free_func(uint8_t *data, uint32_t len)
{
	if(data)
		free(data);
		data = NULL;
}

//设备生产数据函数
/*
		根据 void *args 的指向的结构体（mpbledemo2_info）参数来打包相应的数据包放入
		uint8_t **r_data 指向的地址，并把长度放入 int *r_len
*/
void mpbledemo2_data_produce_func(void *args, uint8_t **r_data, uint32_t *r_len)
{
		
		static uint16_t bleDemoHeadLen = sizeof(BlueDemoHead);
		//获取 bluedemohead 的长度这是 mpbledemo2 与服务器通信定义的结构头。 
		mpbledemo2_info *info = (mpbledemo2_info *)args;
		//把 args 指向 mpbledemo2_info 类型，以获取其内容。
		BaseRequest basReq = {NULL};
		//这里把 BaseRequest  类型 basReq 设置为 null。 
		static uint8_t fix_head_len = sizeof(BpFixHead);
		//获取 BpFixHead 的长度这是微信服务与微信 APP 通信定义的结构头。
		BpFixHead fix_head = {0xFE, 1, 0, htons(ECI_req_auth), 0};
		//初始化 fix_head 	
		mpbledemo2Sta.seq++;
		///req 包数据不能为 0 首先要对 seq++操作。
		switch (info->cmd)
		{
		case CMD_AUTH:
			{
			#if defined EAM_md5AndAesEnrypt
				uint8_t deviceid[] = DEVICE_ID;
				static uint32_t seq = 0x00000001;//
				uint32_t ran = 0x11223344;//为了方便起见这里放了一个固定值做为随机数，在使用时请自行生成随机数。
				ran = t_htonl(ran);
				seq = t_htonl(seq);
				uint8_t id_len = strlen(DEVICE_ID);
				uint8_t* data = malloc(id_len+8);
				if(!data){printf("\r\nNot enough memory!");return;}
				memcpy(data,deviceid,id_len);
				memcpy(data+id_len,(uint8_t*)&ran,4);
				memcpy(data+id_len+4,(uint8_t*)&seq,4);
				uint32_t crc = crc32(0, data, id_len+8);
				crc = t_htonl(crc);
				memset(data,0x00,id_len+8);
				memcpy(data,(uint8_t*)&ran,4);
				memcpy(data+4,(uint8_t*)&seq,4);
				memcpy(data+8,(uint8_t*)&crc,4);	
				uint8_t CipherText[16];
				AES_Init(key);
				AES_Encrypt_PKCS7 (data, CipherText, 12, key);
				if(data){free(data);data = NULL;}
				AuthRequest authReq = {&basReq, true,{md5_type_and_id, MD5_TYPE_AND_ID_LENGTH}, PROTO_VERSION, AUTH_PROTO, (EmAuthMethod)AUTH_METHOD, true ,{CipherText, CIPHER_TEXT_LENGTH}, false, {NULL, 0}, false, {NULL, 0}, false, {NULL, 0},true,{DEVICE_ID,sizeof(DEVICE_ID)}};
				seq++;
			#endif
				
			#if defined EAM_macNoEncrypt
				static uint8_t mac_address[MAC_ADDRESS_LENGTH];
				get_mac_addr(mac_address);
				AuthRequest authReq = {&basReq, false,{NULL, 0}, PROTO_VERSION, AUTH_PROTO, (EmAuthMethod)AUTH_METHOD, false,{NULL, 0}, true, {mac_address, MAC_ADDRESS_LENGTH}, false, {NULL, 0}, false, {NULL, 0},true,{DEVICE_ID,sizeof(DEVICE_ID)}};
			#endif
				
			#if defined EAM_md5AndNoEnrypt
				AuthRequest authReq = {&basReq, true,{md5_type_and_id, MD5_TYPE_AND_ID_LENGTH}, PROTO_VERSION, (EmAuthMethod)AUTH_PROTO, (EmAuthMethod)AUTH_METHOD, false ,{NULL, 0}, false, {NULL, 0}, false, {NULL, 0}, false, {NULL, 0},true,{DEVICE_ID,sizeof(DEVICE_ID)}};
			#endif
				*r_len = epb_auth_request_pack_size(&authReq) + fix_head_len;
				*r_data = (uint8_t *)malloc(*r_len);
				if(!(*r_data)){printf("\r\nNot enough memory!");return;}
				if(epb_pack_auth_request(&authReq, *r_data+fix_head_len, *r_len-fix_head_len)<0)
				{
					*r_data = NULL;
					return;
				}
				fix_head.nCmdId = htons(ECI_req_auth);
				fix_head.nLength = htons(*r_len);
				fix_head.nSeq = htons(mpbledemo2Sta.seq);
				memcpy(*r_data, &fix_head, fix_head_len);
				return ;
		}
		case CMD_INIT:
			{
				//has challeange
				InitRequest initReq = {&basReq,false, {NULL, 0},true, {challeange, CHALLENAGE_LENGTH}};
				*r_len = epb_init_request_pack_size(&initReq) + fix_head_len;
			#if defined EAM_md5AndAesEnrypt
				uint8_t length = *r_len;				
				uint8_t *p = malloc(AES_get_length( *r_len-fix_head_len));
				if(!p){printf("\r\nNot enough memory!");return;}
				*r_len = AES_get_length( *r_len-fix_head_len)+fix_head_len;
			#endif
			//pack data
				*r_data = (uint8_t *)malloc(*r_len);
				if(!(*r_data)){printf("\r\nNot enough memory!");return;}
				if(epb_pack_init_request(&initReq, *r_data+fix_head_len, *r_len-fix_head_len)<0)
				{*r_data = NULL;return;}
				//encrypt body
			#if defined EAM_md5AndAesEnrypt
				AES_Init(session_key);
				AES_Encrypt_PKCS7(*r_data+fix_head_len,p,length-fix_head_len,session_key);//原始数据长度
				memcpy(*r_data + fix_head_len, p, *r_len-fix_head_len);
				if(p)free(p);
			#endif
				fix_head.nCmdId = htons(ECI_req_init);
				fix_head.nLength = htons(*r_len);
				fix_head.nSeq = htons(mpbledemo2Sta.seq);
				memcpy(*r_data, &fix_head, fix_head_len);
				return  ;
		}
		case CMD_SENDDAT:
			{
			#ifdef CATCH_LOG
				printf("\r\n msg to send : %s",(uint8_t*)info->send_msg.str);
			#endif
				BlueDemoHead  *bleDemoHead = (BlueDemoHead*)malloc(bleDemoHeadLen+info->send_msg.len);
				if(!bleDemoHead){printf("\r\nNot enough memory!");return;}
				bleDemoHead->m_magicCode[0] = MPBLEDEMO2_MAGICCODE_H;
				bleDemoHead->m_magicCode[1] = MPBLEDEMO2_MAGICCODE_L;
				bleDemoHead->m_version = htons( MPBLEDEMO2_VERSION);
				bleDemoHead->m_totalLength = htons(bleDemoHeadLen + info->send_msg.len);
				bleDemoHead->m_cmdid = htons(sendTextReq);
				bleDemoHead->m_seq = htons(mpbledemo2Sta.seq);
				bleDemoHead->m_errorCode = 0;	
				/*connect body and head.*/
				/*turn to uint8_t* befort offset.*/
				memcpy((uint8_t*)bleDemoHead+bleDemoHeadLen, info->send_msg.str, info->send_msg.len);			
				SendDataRequest sendDatReq = {&basReq, {(uint8_t*) bleDemoHead, (bleDemoHeadLen + info->send_msg.len)}, false, (EmDeviceDataType)NULL};
				*r_len = epb_send_data_request_pack_size(&sendDatReq) + fix_head_len;
			#if defined EAM_md5AndAesEnrypt
				uint16_t length = *r_len;
				uint8_t *p = malloc(AES_get_length( *r_len-fix_head_len));
				if(!p){printf("\r\nNot enough memory!");return;}
				*r_len = AES_get_length( *r_len-fix_head_len)+fix_head_len;
			#endif
				*r_data = (uint8_t *)malloc(*r_len);
				if(!(*r_data)){printf("\r\nNot enough memory!");return;}
				if(epb_pack_send_data_request(&sendDatReq, *r_data+fix_head_len, *r_len-fix_head_len)<0)
				{
					*r_data = NULL;
				#if defined EAM_md5AndAesEnrypt
					if(p){free(p);
					p = NULL;}
					#endif
					printf("\r\nepb_pack_send_data_request error!");
					return;
				}
			#if defined EAM_md5AndAesEnrypt
				//encrypt body
				AES_Init(session_key);
				AES_Encrypt_PKCS7(*r_data+fix_head_len,p,length-fix_head_len,session_key);//原始数据长度
				memcpy(*r_data + fix_head_len, p, *r_len-fix_head_len);
				if(p){free(p); p = NULL;}
			#endif
				fix_head.nCmdId = htons(ECI_req_sendData);
				fix_head.nLength = htons(*r_len);
				fix_head.nSeq = htons(mpbledemo2Sta.seq);
				memcpy(*r_data, &fix_head, fix_head_len);
				if(bleDemoHead){free(bleDemoHead);bleDemoHead = NULL;}
			#ifdef CATCH_LOG
				printf("\r\n##send data: ");
				uint8_t *d = *r_data;
				for(uint8_t i=0;i<*r_len;++i){
				printf(" %x",d[i]);}
				BpFixHead *fix_head = (BpFixHead *)*r_data;
				printf("\r\n CMDID: %d",ntohs(fix_head->nCmdId));
				printf("\r\n len: %d", ntohs(fix_head->nLength ));
				printf("\r\n Seq: %d", ntohs(fix_head->nSeq));
			#endif
			mpbledemo2Sta.send_data_seq++;
				
				return ;
		}
	}	
}
//设备处理数据函数
int mpbledemo2_data_consume_func(uint8_t *data, uint32_t len)
{	
		BpFixHead *fix_head = (BpFixHead *)data;
		//把数据指向 BpFixHead 固定头 
		uint8_t fix_head_len = sizeof(BpFixHead);
	#ifdef CATCH_LOG
		printf("\r\n##Received data: ");
		uint8_t *d = data;
		for(uint8_t i=0;i<len;++i){
		printf(" %x",d[i]);}
		printf("\r\n CMDID: %d", ntohs(fix_head->nCmdId));
		printf("\r\n len: %d", ntohs(fix_head->nLength));
		printf("\r\n Seq: %d",ntohs(fix_head->nSeq));
	#endif			
		switch(ntohs(fix_head->nCmdId))		//通过包头的 nCmdId 来判断数据包的类型 
		{
			case ECI_none:
				{
				}
				break;
			case ECI_resp_auth:			//authResp 包，则调用相应的解包函数来解包包体。
				{
					AuthResponse* authResp;
					authResp = epb_unpack_auth_response(data+fix_head_len,len-fix_head_len);
				#ifdef CATCH_LOG
					printf("\r\n@@Received 'authResp'\r\n");
				#endif
					if(!authResp){return errorCodeUnpackAuthResp;}
				#ifdef CATCH_LOG
					printf("\r\n unpack 'authResp' success!\r\n");
				#endif
					if(authResp->base_response)
					//判断是 base_response 中的错误码，如果 auth 成功，则设置 auth 状态为 true。//否则打印相关错误信息。 
					{
						if(authResp->base_response->err_code == 0)
						{
							mpbledemo2Sta.auth_state = true;

