ChenYu147/LockInLife/nRF51_SDK_9.0.0_锁生活_7-10/components/libraries/Wechat/services/products/mpbledemo2.c
						}
						else
						{
						#ifdef CATCH_LOG
							printf("\r\n error code:%d",authResp->base_response->err_code);
						#endif
							#ifdef CATCH_LOG
							if(authResp->base_response->has_err_msg)
							{
								printf("\r\n base_response error msg:%s",authResp->base_response->err_msg.str);	
							}
							#endif
							epb_unpack_auth_response_free(authResp);
							return authResp->base_response->err_code;
						}
					}
				#if defined EAM_md5AndAesEnrypt// get sessionkey
					if(authResp->aes_session_key.len)
					{
					#ifdef CATCH_LOG
						printf("\r\nsession_key:");
					#endif
						AES_Init(key);			//执行扩展密钥操作
						AES_Decrypt(session_key,authResp->aes_session_key.data,authResp->aes_session_key.len,key);
						//解密数据			明文							密文													长度									初始化向量
						#ifdef CATCH_LOG
						for(uint8_t i = 0;i<16;i++)
						{
							printf(" 0x%02x",session_key[i]);	
						}
						#endif
					}
				#endif
					epb_unpack_auth_response_free(authResp);
				}
				break;
			case ECI_resp_sendData:
				{
				
			#ifdef CATCH_LOG
				printf("\r\n@@Received 'sendDataResp'\r\n");
			#endif
			#if defined EAM_md5AndAesEnrypt		
					uint32_t length = len- fix_head_len;//加密后数据长度
					uint8_t *p = malloc (length);
					if(!p){printf("\r\nNot enough memory!"); if(data)free(data);data = NULL; return 0;}
					AES_Init(session_key);//执行扩展密钥操作				
					AES_Decrypt(p,data+fix_head_len,len- fix_head_len,session_key);
					//解密数据
					uint8_t temp;
					temp = p[length - 1];//算出填充长度
					len = len - temp;//取加密前数据总长度
					memcpy(data + fix_head_len, p ,length -temp);//把明文放回
					if(p){free(p);p = NULL;}
			#endif	
				SendDataResponse *sendDataResp;
				sendDataResp = epb_unpack_send_data_response(data+fix_head_len,len-fix_head_len);
				if(!sendDataResp)
					{
						return errorCodeUnpackSendDataResp;
					}
			#ifdef CATCH_LOG
				BlueDemoHead *bledemohead = (BlueDemoHead*)sendDataResp->data.data;
				if(ntohs(bledemohead->m_cmdid) == sendTextResp)
					{
						printf("\r\n received msg: %s\r\n",sendDataResp->data.data+sizeof(BlueDemoHead));
					}
			#endif
					if(sendDataResp->base_response->err_code)
					{
						epb_unpack_send_data_response_free(sendDataResp);
						return sendDataResp->base_response->err_code;
					}
					epb_unpack_send_data_response_free(sendDataResp);
			}
				break;
			case ECI_resp_init:
				{
			#ifdef CATCH_LOG
				printf("\r\n@@Received 'initResp'\r\n");
			#endif
			#if defined EAM_md5AndAesEnrypt		
					uint32_t length = len- fix_head_len;//加密后数据长度
					uint8_t *p = malloc (length);
					if(!p){printf("\r\nNot enough memory!");if(data)free(data);data = NULL; return 0;}
					AES_Init(session_key);
					AES_Decrypt(p,data+fix_head_len,len- fix_head_len,session_key);
					//解密数据
					uint8_t temp;
					temp = p[length - 1];//算出填充长度
					len = len - temp;//取加密前数据总长度
					memcpy(data + fix_head_len, p ,length -temp);//把明文放回
					if(p){free(p);p = NULL;}
			#endif		
				InitResponse *initResp = epb_unpack_init_response(data+fix_head_len, len-fix_head_len);
				if(!initResp)
				{
					return errorCodeUnpackInitResp;
				}
				#ifdef CATCH_LOG
					printf("\r\n unpack 'initResp' success!");
				#endif	
					if(initResp->base_response)
					{
						if(initResp->base_response->err_code == 0)
						{
							if(initResp->has_challeange_answer)
							{
								if(crc32(0,challeange,CHALLENAGE_LENGTH) == initResp->challeange_answer)
								{
									mpbledemo2Sta.init_state = true;
								}
							}
							else mpbledemo2Sta.init_state = true;
							mpbledemo2Sta.wechats_switch_state = true;
						}
						else
						{
						#ifdef CATCH_LOG
							printf("\r\n error code:%d",initResp->base_response->err_code);
						#endif	
							if(initResp->base_response->has_err_msg)
							{
							#ifdef CATCH_LOG
								printf("\r\n base_response error msg:%s",initResp->base_response->err_msg.str);
							#endif	
							}
							epb_unpack_init_response_free(initResp);
							return initResp->base_response->err_code;
						}
					}
				epb_unpack_init_response_free(initResp);
			}
				break;
			case ECI_push_recvData:		//收到数据
				{	
						
				#if defined EAM_md5AndAesEnrypt
					uint32_t length = len- fix_head_len;//加密后数据长度
					uint8_t *p = malloc (length);
					if(!p){printf("\r\nNot enough memory!");if(data)free(data); data =NULL; return 0;}
					AES_Init(session_key);	
					AES_Decrypt(p,data+fix_head_len,len- fix_head_len,session_key);
					//解密数据
					uint8_t temp;
					temp = p[length - 1];//算出填充长度
					len = len - temp;//取加密前数据总长度
					memcpy(data + fix_head_len, p ,length -temp);//把明文放回
					if(p){free(p);p = NULL;}
				#endif
			RecvDataPush *recvDatPush;
			recvDatPush = epb_unpack_recv_data_push(data+fix_head_len, len-fix_head_len);
		#ifdef CATCH_LOG
			printf("\r\n@@Received 'recvDataPush'\r\n");
		#endif
			if(!recvDatPush)
			{
				return errorCodeUnpackRecvDataPush;
			}
		#ifdef CATCH_LOG
			printf("\r\n unpack the 'recvDataPush' successfully! \r\n");
			if(recvDatPush->base_push == NULL)
			{
				printf("\r\n recvDatPush->base_push is NULL! \r\n");
			}
			else 
			{
				printf("\r\n recvDatPush->base_push is not NULL! \r\n");
			}
			printf("\r\n recvDatPush->data.len: %x \r\n",recvDatPush->data.len);
			printf("\r\n recvDatPush->data.data:  \r\n");
			const uint8_t *d = recvDatPush->data.data;
			for(uint8_t i=0;i<recvDatPush->data.len;++i){
			printf(" %x",d[i]);}
			if(recvDatPush->has_type)
			{
				printf("\r\n recvDatPush has type! \r\n");
				printf("\r\n type: %d\r\n",recvDatPush->type);
			}
		#endif	
			BlueDemoHead *bledemohead = (BlueDemoHead*)recvDatPush->data.data;
			//把收到的数据包包体中的数据段指向  BlueDemoHead  类型 
		#ifdef CATCH_LOG
			printf("\r\n magicCode: %x",bledemohead->m_magicCode[0]);
			printf(" %x",bledemohead->m_magicCode[1]);
			printf("\r\n version: %x",ntohs(bledemohead->m_version));
			printf("\r\n totalLength: %x",ntohs(bledemohead->m_totalLength));
			printf("\r\n cmdid: %x",ntohs(bledemohead->m_cmdid ));
			printf("\r\n errorCode: %x",ntohs(bledemohead->m_errorCode));
		#endif	
			if(ntohs(bledemohead->m_cmdid ) == openLightPush)
			{
				#ifdef CATCH_LOG
						printf("\r\n light on!! ");
				#endif
						nrf_gpio_pin_set(BLUE_LED);				
			}
			else if(ntohs(bledemohead->m_cmdid )  == closeLightPush)
			{
		#ifdef CATCH_LOG
					printf("\r\n light off!! ");
		#endif
			
					
