ChenYu147/LockInLife/nRF51_SDK_9.0.0_锁生活_7-10/components/libraries/Wechat/services/products/mpbledemo2.c
			}
			epb_unpack_recv_data_push_free(recvDatPush);
			mpbledemo2Sta.push_data_seq++;		
	/*
	包头里的 Seq 表示一个命令序号
		Req 命令：seq 不能为零，设备每发一个 req 请求，必须 seq+1。每个请求里的序号和对应的回包里的序号相同。 
		Resp 命令：回包的序号和请求里的序号相同。 
		push：序号为零。 
	*/
		}
				break;
			case ECI_push_switchView:		//切换界面 push 通知 
				{
			
					mpbledemo2Sta.wechats_switch_state = !mpbledemo2Sta.wechats_switch_state;
			#ifdef CATCH_LOG
				printf("\r\n@@Received 'switchViewPush'\r\n");
			#endif
			#if defined EAM_md5AndAesEnrypt		
					uint32_t length = len- fix_head_len;//加密后数据长度
					uint8_t *p = malloc (length);
					if(!p){printf("\r\nNot enough memory!");if(data)free(data);data = NULL; return 0;}
					AES_Init(session_key);
					//解密数据
					AES_Decrypt(p,data+fix_head_len,len- fix_head_len,session_key);
					
					uint8_t temp;
					temp = p[length - 1];//算出填充长度
					len = len - temp;//取加密前数据总长度
					memcpy(data + fix_head_len, p ,length -temp);//把明文放回
					if(p){free(p);p = NULL;}
			#endif		
				SwitchViewPush *swichViewPush;
				swichViewPush = epb_unpack_switch_view_push(data+fix_head_len,len-fix_head_len);
				if(!swichViewPush)
				{
					return errorCodeUnpackSwitchViewPush;
				}
				epb_unpack_switch_view_push_free(swichViewPush);
			}
				break;
			case ECI_push_switchBackgroud:		//IOS 平台微信进入后台通知。
				{
			#ifdef CATCH_LOG
				printf("\r\n@@Received 'switchBackgroudPush'\r\n");
			#endif
			#if defined EAM_md5AndAesEnrypt
					uint32_t length = len- fix_head_len;//加密后数据长度
					uint8_t *p = malloc (length);
					if(!p){printf("\r\nNot enough memory!");if(data)free(data);data = NULL;  return 0;}
					AES_Init(session_key);
					//解密数据
					AES_Decrypt(p,data+fix_head_len,len- fix_head_len,session_key);
					uint8_t temp;
					temp = p[length - 1];//算出填充长度
					len = len - temp;//取加密前数据总长度
					memcpy(data + fix_head_len, p ,length -temp);//把明文放回
					if(data){free(p);p = NULL;}
			#endif
				SwitchBackgroudPush *switchBackgroundPush = epb_unpack_switch_backgroud_push(data+fix_head_len,len-fix_head_len);
				if(! switchBackgroundPush)
				{
					return errorCodeUnpackSwitchBackgroundPush;
				}	
				epb_unpack_switch_backgroud_push_free(switchBackgroundPush);
			}
				break;
			case ECI_err_decode:
				break;
			default:
				{
		#ifdef CATCH_LOG
			printf("\r\n !!ERROR CMDID:%d",ntohs(fix_head->nCmdId));
		#endif
			}
				break;
		}
		return 0;
}
void mpbledemo2_data_error_func(int error_code)
{
	if(error_code)
	{
		#ifdef CATCH_LOG
			printf("\r\n! error: mpbledemo2 reseted");
		#endif
		NVIC_SystemReset();
	}
}
data_handler mpbledemo2_data_handler = {
		.m_product_type = PRODUCT_TYPE_MPBLEDEMO2,		 							//设备类型信息
		.m_data_produce_func = &mpbledemo2_data_produce_func,				//设备生产数据函数接口
		.m_data_free_func = &mpbledemo2_data_free_func,							//设备释放数据接口
		.m_data_consume_func = &mpbledemo2_data_consume_func,				//设备处理数据函数接口
		.m_data_error_func = &mpbledemo2_data_error_func,						//设备错误处理函数接口
	
		.m_data_on_ble_evt_func = &ble_mpbledemo2_on_ble_evt,				//设备处理 ble 事件函数接口
		.m_data_init_func = &mpbledemo2_init,												//设备初始化函数接口
		.m_data_main_process_func = &mpbledemo2_main_process,				//设备主流程函数接口
		.m_data_button_handler_func = &mpbledemo2_button_handler,		//设备按键处理函数接口 
		.m_data_produce_args = &m_info,															//设备数据 
		.next = NULL 																								//设备存储链表指针 
};
